# 자료형
"""
자료형이란 프로그래밍을 할 때 쓰이는 숫자, 문자열 등과 같이
자료 형태로 사용하는 모든 것을 뜻한다.
프로그램의 기본이자 핵심 단위가 바로 자료형이다.
"""
# 숫자형
"""
숫자 형태로 이루어진 자료형으로, 정수형, 실수형, 8진수, 16진수도 있다.
"""
# 정수형 (integer, int)
"""
정수형은 소수점이 없는 수, 즉 음의 정수, 0, 양의 정수를 나타내는 자료형이다.
소수점이 없는 모든 종류의 정수를 저장할 수 있다.
변수에 정수값을 할당하면 파이썬은 해당 변수를 정수형으로 자동 인식함.
"""
# i = 123 양의 정수 대입
# i = -178 음의 정수 대입
# i = 0 숫자 0을 대입

# 실수형 (floating point, float)
"""
실수형 자료형은 float으로, 소수점을 포함하는 숫자를 다루며
부동소수점(floating point) 방식으로 표현된다. 
"""
# f = 1.2
# f = -3.45

"""
아래는 '컴퓨터식 지수 표현 방식'이다.
"""
a = 4.24E10
